%% DistObsv 所有参数定义
% 文件名: DistObsv_All_Para_Init

%% DistbObsv_AsyTime 参数定义a_
% K_0 为正定对角增益阵
% K_0 的最小特征值越大则收敛速度越快；且扰动估计误差收敛半径随着K_0的最小特征值指数收敛
global K_0 k_01 k_02
% k_01 = 1500; k_02 = 1500; K_0 = diag([k_01, k_02]);  %% 正常在200-300之间吧 与正弦输入百分比误差倒数
% k_01 = 200; k_02 = 200; K_0 = diag([k_01, k_02]);  %% 正常在200-300之间吧 与正弦输入百分比误差倒数
k_01 = 200; k_02 = 200; K_0 = diag([k_01, k_02]);  %% 正常在200-300之间吧 与正弦输入百分比误差倒数

%% DistbObsv_FiniteTime 参数定义
% 通过收敛时间分析
% global M
% K_1 K_2 K_3 为正定对角增益阵
% K_1 K_2 K_3 的最小特征值越大则收敛速度越快；且扰动估计误差收敛半径随着K_0的最小特征值收敛
global K_1 k_11 k_12 K_2 k_21 k_22 K_3 k_31 k_32 
k_11 = 100; k_12 = 100; K_1 = diag([k_11, k_12]);     % 控制收敛时间，越大时间越短;控制稳态的
k_21 = 20; k_22 = 20; K_2 = diag([k_21, k_22]);     % 控制收敛半径，越大半径越大
k_31 = 400; k_32 = 400; K_3 = diag([k_31, k_32]);   % 控制收敛时间，越小时间越短；控制动态的
% k_11 = 20; k_12 = 20; K_1 = diag([k_11, k_12]);     % 控制收敛时间，越大时间越短;控制稳态的
% k_21 = 20; k_22 = 20; K_2 = diag([k_21, k_22]);     % 控制收敛半径，越大半径越大
% k_31 = 400; k_32 = 400; K_3 = diag([k_31, k_32]);   % 控制收敛时间，越小时间越短；控制动态的
global b_1 b_2      % b_1 b_2 都是正实数，且b_1 < b_2, 收敛时间随着b_1/b_2的值增大的减小；控制动态的
b_1 = 1091;  % 281 1091
b_2 = 1093;  % 283 1093
% global K_1 k_11 k_12 K_2 k_21 k_22 K_3 k_31 k_32 
% k_11 = 1e4; k_12 = 1e4; K_1 = diag([k_11, k_12]);     % 控制收敛时间，越大时间越短;控制稳态的
% k_21 = 16; k_22 = 16; K_2 = diag([k_21, k_22]);     % 控制收敛半径，越大半径越大
% k_31 = 1e-2; k_32 = 1e-2; K_3 = diag([k_31, k_32]);   % 控制收敛时间，越小时间越短；控制动态的
% global b_1 b_2      % b_1 b_2 都是正实数，且b_1 < b_2, 收敛时间随着b_1/b_2的值增大的减小；控制动态的
% b_1 = 569;  % 281
% b_2 = 571;  % 283
% 收敛时间计算
global m_0 x_G I_yy
m = m_0;
M_RB = [m, -m * x_G;
        -m * x_G, I_yy;];
global  Z_w_dot Z_q_dot M_q_dot M_w_dot
M_A = -[Z_w_dot Z_q_dot;
        M_w_dot M_q_dot];
M = M_RB + M_A;
c = (b_1 + b_2)/(2 * b_2);
b = min(eig(K_3)) * (2/max(eig(M))) ^ c;
a = 2 * min(eig(K_1)) / min(eig(M));
Tf = 1 / (b * (1 + c)) * log(1 + b * 0.5* max(eig(M)) * norm([1,1],2) / (2 * min(eig(K_1)) / max(eig(M))));
fprintf("Tf = %f, %f/n", Tf);
clear a b c;

%% DistbObsv_FixedTime 参数定义
global K_4 k_41 k_42 K_5 k_51 k_52
% k_41 = 1; k_42 = 1; K_4 = diag([k_41, k_42]); % 扰动力收敛半径和稳定性正比与参数值
% k_51 = 0.5; k_52 = 0.5; K_5 = diag([k_51, k_52]);   % 扰动力收敛时间随着这两个数值的增大而减小
k_41 = 6; k_42 = 6; K_4 = diag([k_41, k_42]);   % 扰动力收敛半径和稳定性正比与参数值    Cw = 16
k_51 = 11; k_52 = 11; K_5 = diag([k_51, k_52]);   % 扰动力收敛时间随着这两个数值的增大而减小
% k_41 = 9; k_42 = 9;K_4 = diag([k_41, k_42]);  %
% k_51 = 20;k_52 = 20;K_5 = diag([k_51, k_52]); %
% k_41 = 9; k_42 = 9; K_4 = diag([k_41, k_42]);   % 扰动力收敛半径和稳定性正比与参数值Cw=25
% k_51 = 52; k_52 = 52; K_5 = diag([k_51, k_52]);   % 扰动力收敛时间随着这两个数值的增大而减小
global miu
miu = 1.2;  % 曲线的抖动程度 1.2

%% 显示
disp("########### DistObsv 参数初始化完成 ###########");

%% 备选参数
% global K_1 k_11 k_12 K_2 k_21 k_22 K_3 k_31 k_32 
% k_11 = 900; k_12 = 900; K_1 = diag([k_11, k_12]);     % 控制收敛时间，越大时间越短
% k_21 = 50; k_22 = 50; K_2 = diag([k_21, k_22]);     % 控制收敛半径，越大半径越大
% k_31 = 0.0015; k_32 = 0.0015; K_3 = diag([k_31, k_32]);   % 控制收敛时间，越小时间越短
% global b_1 b_2      % b_1 b_2 都是正实数，且b_1 < b_2, 收敛时间随着b_1/b_2的值增大的减小
% b_1 = 1;  % 281
% b_2 = 11;  % 283
% 
% global K_1 k_11 k_12 K_2 k_21 k_22 K_3 k_31 k_32 
% k_11 = 3000; k_12 = 3000; K_1 = diag([k_11, k_12]);     % 控制收敛时间，越大时间越短;控制稳态的
% k_21 = 20; k_22 = 20; K_2 = diag([k_21, k_22]);     % 控制收敛半径，越大半径越大
% k_31 = 0.001; k_32 = 0.001; K_3 = diag([k_31, k_32]);   % 控制收敛时间，越小时间越短；控制动态的
% global b_1 b_2      % b_1 b_2 都是正实数，且b_1 < b_2, 收敛时间随着b_1/b_2的值增大的减小；控制动态的
% b_1 = 1;  % 281
% b_2 = 7;  % 283